const retornoDAV = {
    "id": "76a66dca-fdc4-4b96-99dd-e58ac1da96fb",
    "name": null,
    "available": [
        {
            "start": "2023-05-25T20:45:00.000Z",
            "end": "2023-05-25T21:30:00.000Z"
        },
        {
            "start": "2023-05-25T20:00:00.000Z",
            "end": "2023-05-25T20:45:00.000Z"
        },
        {
            "start": "2023-05-25T19:15:00.000Z",
            "end": "2023-05-25T20:00:00.000Z"
        },
        {
            "start": "2023-05-25T18:30:00.000Z",
            "end": "2023-05-25T19:15:00.000Z"
        },
        {
            "start": "2023-05-25T17:45:00.000Z",
            "end": "2023-05-25T18:30:00.000Z"
        },
        {
            "start": "2023-05-25T17:00:00.000Z",
            "end": "2023-05-25T17:45:00.000Z"
        },
        {
            "start": "2023-05-23T20:45:00.000Z",
            "end": "2023-05-23T21:30:00.000Z"
        },
        {
            "start": "2023-05-23T20:00:00.000Z",
            "end": "2023-05-23T20:45:00.000Z"
        },
        {
            "start": "2023-05-23T19:15:00.000Z",
            "end": "2023-05-23T20:00:00.000Z"
        },
        {
            "start": "2023-05-23T18:30:00.000Z",
            "end": "2023-05-23T19:15:00.000Z"
        },
        {
            "start": "2023-05-23T17:45:00.000Z",
            "end": "2023-05-23T18:30:00.000Z"
        },
        {
            "start": "2023-05-23T17:00:00.000Z",
            "end": "2023-05-23T17:45:00.000Z"
        },
        {
            "start": "2023-05-19T20:45:00.000Z",
            "end": "2023-05-19T21:30:00.000Z"
        },
        {
            "start": "2023-05-19T20:00:00.000Z",
            "end": "2023-05-19T20:45:00.000Z"
        },
        {
            "start": "2023-05-19T19:15:00.000Z",
            "end": "2023-05-19T20:00:00.000Z"
        },
        {
            "start": "2023-05-19T18:30:00.000Z",
            "end": "2023-05-19T19:15:00.000Z"
        },
        {
            "start": "2023-05-19T17:45:00.000Z",
            "end": "2023-05-19T18:30:00.000Z"
        },
        {
            "start": "2023-05-19T17:00:00.000Z",
            "end": "2023-05-19T17:45:00.000Z"
        },
        {
            "start": "2023-05-18T20:45:00.000Z",
            "end": "2023-05-18T21:30:00.000Z"
        },
        {
            "start": "2023-05-18T20:00:00.000Z",
            "end": "2023-05-18T20:45:00.000Z"
        },
        {
            "start": "2023-05-18T19:15:00.000Z",
            "end": "2023-05-18T20:00:00.000Z"
        },
        {
            "start": "2023-05-18T17:45:00.000Z",
            "end": "2023-05-18T18:30:00.000Z"
        },
        {
            "start": "2023-05-18T17:00:00.000Z",
            "end": "2023-05-18T17:45:00.000Z"
        }
    ]
}
const tratadoHorarios = [
    {
        "valor": "18/05/2023 às 11:45h",
        "inicio": "2023-05-18T11:45:00.000Z",
        "fim": "2023-05-18T17:45:00.000Z"
    },
    {
        "valor": "18/05/2023 às 12:30h",
        "inicio": "2023-05-18T12:30:00.000Z",
        "fim": "2023-05-18T18:30:00.000Z"
    },
    {
        "valor": "18/05/2023 às 14:00h",
        "inicio": "2023-05-18T14:00:00.000Z",
        "fim": "2023-05-18T20:00:00.000Z"
    },
    {
        "valor": "18/05/2023 às 14:45h",
        "inicio": "2023-05-18T14:45:00.000Z",
        "fim": "2023-05-18T20:45:00.000Z"
    },
    {
        "valor": "18/05/2023 às 15:30h",
        "inicio": "2023-05-18T15:30:00.000Z",
        "fim": "2023-05-18T21:30:00.000Z"
    },
    {
        "valor": "19/05/2023 às 11:45h",
        "inicio": "2023-05-19T11:45:00.000Z",
        "fim": "2023-05-19T17:45:00.000Z"
    },
    {
        "valor": "19/05/2023 às 12:30h",
        "inicio": "2023-05-19T12:30:00.000Z",
        "fim": "2023-05-19T18:30:00.000Z"
    },
    {
        "valor": "19/05/2023 às 13:15h",
        "inicio": "2023-05-19T13:15:00.000Z",
        "fim": "2023-05-19T19:15:00.000Z"
    },
    {
        "valor": "19/05/2023 às 14:00h",
        "inicio": "2023-05-19T14:00:00.000Z",
        "fim": "2023-05-19T20:00:00.000Z"
    },
    {
        "valor": "19/05/2023 às 14:45h",
        "inicio": "2023-05-19T14:45:00.000Z",
        "fim": "2023-05-19T20:45:00.000Z"
    },
    {
        "valor": "19/05/2023 às 15:30h",
        "inicio": "2023-05-19T15:30:00.000Z",
        "fim": "2023-05-19T21:30:00.000Z"
    },
    {
        "valor": "23/05/2023 às 11:45h",
        "inicio": "2023-05-23T11:45:00.000Z",
        "fim": "2023-05-23T17:45:00.000Z"
    },
    {
        "valor": "23/05/2023 às 12:30h",
        "inicio": "2023-05-23T12:30:00.000Z",
        "fim": "2023-05-23T18:30:00.000Z"
    },
    {
        "valor": "23/05/2023 às 13:15h",
        "inicio": "2023-05-23T13:15:00.000Z",
        "fim": "2023-05-23T19:15:00.000Z"
    },
    {
        "valor": "23/05/2023 às 14:00h",
        "inicio": "2023-05-23T14:00:00.000Z",
        "fim": "2023-05-23T20:00:00.000Z"
    },
    {
        "valor": "23/05/2023 às 14:45h",
        "inicio": "2023-05-23T14:45:00.000Z",
        "fim": "2023-05-23T20:45:00.000Z"
    },
    {
        "valor": "23/05/2023 às 15:30h",
        "inicio": "2023-05-23T15:30:00.000Z",
        "fim": "2023-05-23T21:30:00.000Z"
    },
    {
        "valor": "25/05/2023 às 11:45h",
        "inicio": "2023-05-25T11:45:00.000Z",
        "fim": "2023-05-25T17:45:00.000Z"
    },
    {
        "valor": "25/05/2023 às 12:30h",
        "inicio": "2023-05-25T12:30:00.000Z",
        "fim": "2023-05-25T18:30:00.000Z"
    },
    {
        "valor": "25/05/2023 às 13:15h",
        "inicio": "2023-05-25T13:15:00.000Z",
        "fim": "2023-05-25T19:15:00.000Z"
    },
    {
        "valor": "25/05/2023 às 14:00h",
        "inicio": "2023-05-25T14:00:00.000Z",
        "fim": "2023-05-25T20:00:00.000Z"
    },
    {
        "valor": "25/05/2023 às 14:45h",
        "inicio": "2023-05-25T14:45:00.000Z",
        "fim": "2023-05-25T20:45:00.000Z"
    },
    {
        "valor": "25/05/2023 às 15:30h",
        "inicio": "2023-05-25T15:30:00.000Z",
        "fim": "2023-05-25T21:30:00.000Z"
    }
]

const retornoDAV2 = {
    "id": "76a66dca-fdc4-4b96-99dd-e58ac1da96fb",
    "name": null,
    "available": [{
        "start": "2023-05-18T16:15:00.000Z",
        "end": "2023-05-18T17:00:00.000Z"
    },{
            "start": "2023-05-18T17:45:00.000Z",
            "end": "2023-05-18T18:30:00.000Z"
        },
        {
            "start": "2023-05-18T17:00:00.000Z",
            "end": "2023-05-18T17:45:00.000Z"
        }
        
    ]
}

function run(statusAgenda,corpoAgenda) {
	let horarios=[]
	if(statusAgenda == "200")
	{
		corpoAgenda = JSON.parse(corpoAgenda)
		corpoAgenda.available.forEach((item)=>{
			let inicio = converterDataHoraFuso(item.start)
			let fim = converterDataHoraFuso(item.end)
			
			let dia = inicio.split("T")[0]

			let hora = inicio.substring(11,16)+"h"
			horarios.unshift({
				"valor": converterDataDoIso(dia) + " às " + hora,
				"inicio":inicio,
				"fim":fim
			})
		})
	}
	return JSON.stringify(horarios)	
}

function converterDataHoraFuso(dataHoraString) {
    let now = new Date(dataHoraString);
	
    let utc_timestamp = Date.UTC(
        now.getUTCFullYear(),
        now.getUTCMonth(),
        now.getUTCDate(),
        now.getUTCHours(),
        now.getUTCMinutes(),
        now.getUTCSeconds(),
        now.getUTCMilliseconds())
    
    return (new Date(utc_timestamp + (-3 * 3600 * 1000))).toISOString()
}

function nowUTC(dataString,offset) {
    let now = new Date(dataString);
	
    let utc_timestamp = Date.UTC(
        now.getUTCFullYear(),
        now.getUTCMonth(),
        now.getUTCDate(),
        now.getUTCHours(),
        now.getUTCMinutes(),
        now.getUTCSeconds(),
        now.getUTCMilliseconds())

    return new Date(utc_timestamp + (offset * 3600 * 1000))
}

function converterDataDoIso(dataString) {
    let partes = dataString.split("-")
    let dataFormatada = partes.reverse().join("/")
    return dataFormatada
}

test("converterDataHora",()=>{
    expect(converterDataDoIso("2023-05-05")).toBe("05/05/2023")
    expect(converterDataDoIso("2024-02-12")).toBe("12/02/2024")
    expect(converterDataDoIso("2022-12-30")).toBe("30/12/2022")

})

test("converterDataHora",()=>{
    expect(converterDataHoraFuso("2023-05-06T02:00:00.000Z")).toBe("2023-05-05T23:00:00.000Z")
    expect(converterDataHoraFuso("2023-05-05T15:00:00.000Z")).toBe("2023-05-05T12:00:00.000Z")
    expect(converterDataHoraFuso("2023-05-05T10:00:00.000Z")).toBe("2023-05-05T07:00:00.000Z")
})

test("retorna lista horarios",()=>{
    expect(run("200",JSON.stringify(retornoDAV2))).toBe(JSON.stringify([
        {
            "valor": "18/05/2023 às 14:00h",
            "inicio": "2023-05-18T14:00:00.000Z", 
            "fim": "2023-05-18T14:45:00.000Z"
        },{
            "valor": "18/05/2023 às 14:45h",
            "inicio": "2023-05-18T14:45:00.000Z",
            "fim": "2023-05-18T15:30:00.000Z"
        },{
            "valor": "18/05/2023 às 13:15h",
            "inicio": "2023-05-18T13:15:00.000Z",
            "fim": "2023-05-18T14:00:00.000Z"
        }]))
        
        /*JSON.stringify([
            {
                "valor": "18/05/2023 às 11:45h",
                "inicio": "2023-05-18T11:45:00.000Z",
                "fim": "2023-05-18T17:45:00.000Z"
            },
            {
                "valor": "18/05/2023 às 12:30h",
                "inicio": "2023-05-18T12:30:00.000Z",
                "fim": "2023-05-18T18:30:00.000Z"
            },
            {
                "valor": "18/05/2023 às 14:00h",
                "inicio": "2023-05-18T14:00:00.000Z",
                "fim": "2023-05-18T20:00:00.000Z"
            },
            {
                "valor": "18/05/2023 às 14:45h",
                "inicio": "2023-05-18T14:45:00.000Z",
                "fim": "2023-05-18T20:45:00.000Z"
            },
            {
                "valor": "18/05/2023 às 15:30h",
                "inicio": "2023-05-18T15:30:00.000Z",
                "fim": "2023-05-18T21:30:00.000Z"
            },
            {
                "valor": "19/05/2023 às 11:45h",
                "inicio": "2023-05-19T11:45:00.000Z",
                "fim": "2023-05-19T17:45:00.000Z"
            },
            {
                "valor": "19/05/2023 às 12:30h",
                "inicio": "2023-05-19T12:30:00.000Z",
                "fim": "2023-05-19T18:30:00.000Z"
            },
            {
                "valor": "19/05/2023 às 13:15h",
                "inicio": "2023-05-19T13:15:00.000Z",
                "fim": "2023-05-19T19:15:00.000Z"
            },
            {
                "valor": "19/05/2023 às 14:00h",
                "inicio": "2023-05-19T14:00:00.000Z",
                "fim": "2023-05-19T20:00:00.000Z"
            },
            {
                "valor": "19/05/2023 às 14:45h",
                "inicio": "2023-05-19T14:45:00.000Z",
                "fim": "2023-05-19T20:45:00.000Z"
            },
            {
                "valor": "19/05/2023 às 15:30h",
                "inicio": "2023-05-19T15:30:00.000Z",
                "fim": "2023-05-19T21:30:00.000Z"
            },
            {
                "valor": "22/05/2023 às 14:00h",
                "inicio": "2023-05-22T14:00:00.000Z",
                "fim": "2023-05-22T20:00:00.000Z"
            },
            {
                "valor": "22/05/2023 às 14:45h",
                "inicio": "2023-05-22T14:45:00.000Z",
                "fim": "2023-05-22T20:45:00.000Z"
            },
            {
                "valor": "22/05/2023 às 15:30h",
                "inicio": "2023-05-22T15:30:00.000Z",
                "fim": "2023-05-22T21:30:00.000Z"
            },
            {
                "valor": "23/05/2023 às 11:45h",
                "inicio": "2023-05-23T11:45:00.000Z",
                "fim": "2023-05-23T17:45:00.000Z"
            },
            {
                "valor": "23/05/2023 às 12:30h",
                "inicio": "2023-05-23T12:30:00.000Z",
                "fim": "2023-05-23T18:30:00.000Z"
            },
            {
                "valor": "23/05/2023 às 13:15h",
                "inicio": "2023-05-23T13:15:00.000Z",
                "fim": "2023-05-23T19:15:00.000Z"
            },
            {
                "valor": "23/05/2023 às 14:00h",
                "inicio": "2023-05-23T14:00:00.000Z",
                "fim": "2023-05-23T20:00:00.000Z"
            },
            {
                "valor": "23/05/2023 às 14:45h",
                "inicio": "2023-05-23T14:45:00.000Z",
                "fim": "2023-05-23T20:45:00.000Z"
            },
            {
                "valor": "23/05/2023 às 15:30h",
                "inicio": "2023-05-23T15:30:00.000Z",
                "fim": "2023-05-23T21:30:00.000Z"
            },
            {
                "valor": "25/05/2023 às 11:45h",
                "inicio": "2023-05-25T11:45:00.000Z",
                "fim": "2023-05-25T17:45:00.000Z"
            },
            {
                "valor": "25/05/2023 às 12:30h",
                "inicio": "2023-05-25T12:30:00.000Z",
                "fim": "2023-05-25T18:30:00.000Z"
            },
            {
                "valor": "25/05/2023 às 13:15h",
                "inicio": "2023-05-25T13:15:00.000Z",
                "fim": "2023-05-25T19:15:00.000Z"
            },
            {
                "valor": "25/05/2023 às 14:00h",
                "inicio": "2023-05-25T14:00:00.000Z",
                "fim": "2023-05-25T20:00:00.000Z"
            },
            {
                "valor": "25/05/2023 às 14:45h",
                "inicio": "2023-05-25T14:45:00.000Z",
                "fim": "2023-05-25T20:45:00.000Z"
            },
            {
                "valor": "25/05/2023 às 15:30h",
                "inicio": "2023-05-25T15:30:00.000Z",
                "fim": "2023-05-25T21:30:00.000Z"
            }
        ]
    )*/
})